Rokasbarasa1/STM32-Quadcopter/src/main.c
/* Auto generated shit -----------------------------------------------*/
#include "main.h"

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
/* Actual functional code -----------------------------------------------*/

#include "../lib/printf/retarget.h"
#include "stdio.h"
#include "string.h"
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/gy271_qmc5883l/gy271.h"
#include "../lib/bmp280/bmp280.h"
#include "../lib/bn357/bn357.h"
#include "../lib/utils/ned_coordinates/ned_coordinates.h"
#include "../lib/nrf24l01/nrf24l01.h"

#define RxBuf_SIZE 500
#define MainBuf_SIZE 550

/**
 * Pre-scaler: 1000
 * Counter period: 1000
 * Timer clock = 50,000,000/1000 = 50KHz
 * PWM Frequency = 50,000/1000 = 50Hz
 * Duty cycle = 1s/PWM Freq = 20ms
 *
 * For servo it needs to be from 0.5ms to 2.5ms at the most extremes.
 * These are the values to set to CCR
 * 0.5/20 * 1000(Counter period) = 25
 * 2.5/20 * 1000 = 125
 */
#define MAX_TIMER_VALUE 999

uint8_t MainBuf[MainBuf_SIZE];
uint8_t RxBuf[RxBuf_SIZE];

// Interrupt for uart 2 data received
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
    // make sure the dma is initialized before uart for this to work
    // and that dma is initialized after GPIO.

    // If the stm32 is restarted and while it is initializing dma the
    // data arrives from the uart it fucks up. So you have to restart it a few times

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 1);

    if (huart->Instance == USART2)
    {
        printf("Interrupt UART 2\n");
        memcpy((uint8_t *)MainBuf, RxBuf, Size);
        bn357_parse_and_store(MainBuf, Size);
        /* start the DMA again */
        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, (uint8_t *)RxBuf, RxBuf_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

// Interrupt for uart 2 when it crashes to restart it
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        printf("Error UART 2\n");
        HAL_UART_DeInit(&huart2);
        HAL_UART_Init(&huart2);

        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, RxBuf, RxBuf_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

uint16_t setServoActivationPercent(uint8_t percent, uint16_t minValue, uint16_t maxValue);
void extract_request_values(char *request, uint8_t request_size, uint8_t *x, uint8_t *y);

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2
const float hard_iron_correction[3] = {205.801249, -329.544434, -51.579693};
const float soft_iron_correction[3][3] = {{0.178946, 0.001568, -0.007812},
                                          {0.001568, 0.181964, 0.002300},
                                          {-0.007812, 0.002300, 0.186567}};

const float accelerometer_correction[3] = {0.008026, -0.038413, 1.149903};
const float gyro_correction[3] = {-2.371043, 2.884454, 0.648193};

const float refresh_rate_hz = 100;

// gps variables
volatile float longitude = 0.0;
volatile float latitude = 0.0;
volatile char longitude_direction = 'f';
volatile char latitude_direction = 'f';

float acceleration_data[] = {0, 0, 0};
float gyro_angular[] = {0, 0, 0};
float complementary_ratio = 0.02;
float gyro_degrees[] = {0, 0, 0};
float magnetometer_data[] = {0, 0, 0};

// bmp280 data
float pressure = 0.0;
float temperature = 0.0;

float north_direction[] = {0, 0, 0};
float east_direction[] = {0, 0, 0};
float down_direction[] = {0, 0, 0};

float pitch = 0;
float roll = 0;
float yaw = 0;

// for nrf24 radio transmissions
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
uint8_t rx_data[32];

// PWM pins
// PA8  - 1 TIM1
// PA11 - 4 TIM1
// PA0  - 1 TIM2
// PA1  - 2 TIM2

// UART pins
// PA2  UART2 tx GPS
// PA3  UART2 rx GPS
// PA10 UART1 rx FTDI
// PA9  UART1 tx FTDI

// I2C pins
// PB7  I2C1 SDA
// PB6  I2C1 SCL

// SPI pins
// PA5  SPI1 SCK
// PA6  SPI1 MISO
// PA7  SPI1 MOSI

// GPIO
// PC13 Internal LED
// PB5  SPI RADIO
// PB4  SPI RADIO
// PA12 LED

int main(void)
{
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);

    // HAL_UART_RegisterCallback(&huart2, HAL_UART_ERROR_CB_ID, HAL_UART_ErrorCallback);

    // HAL_UARTEx_ReceiveToIdle_DMA(&huart2, RxBuf, RxBuf_SIZE);
    // __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);

    printf("OK\n");
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(&hi2c1, 1, accelerometer_correction, gyro_correction);
    uint8_t gy271 = init_gy271(&hi2c1, 1, hard_iron_correction, soft_iron_correction);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && gy271 && bmp280 && bn357 && nrf24)
    {
        printf("OK\n");
    }
    else
    {
        printf("NOT OK\n");
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);

    uint8_t brightness = 0;
    uint32_t loop_start_time = HAL_GetTick();
    uint32_t loop_end_time = 0;
    int16_t deltaLoopTime = 0;

    // 
    // find_accelerometer_error(1000);
    // find_gyro_error(300);

    // calculate initial position
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    gy271_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_pitch_and_roll(acceleration_data, &roll, &pitch);
    calculate_yaw(magnetometer_data, &yaw);

    gyro_degrees[0] = -roll;
    gyro_degrees[1] = -pitch;
    gyro_degrees[2] = -yaw;
    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);


    // init(&hi2c1, &hspi1, &htim1, &htim2, &huart1, &huart2, &hdma_usart2_rx);
    while (1)
    {
        // printf("New loop\n");

        // Read sensor data
        uint32_t start_point = HAL_GetTick();

        longitude = bn357_get_longitude();
        latitude = bn357_get_latitude();


