Rokasbarasa1/STM32-Quadcopter/src/main.c
        longitude_direction = bn357_get_longitude_direction();
        latitude_direction = bn357_get_latitude_direction();
        temperature = bmp280_get_temperature_celsius();
        pressure = bmp280_get_pressure_hPa();


        mpu6050_get_accelerometer_readings_gravity(acceleration_data);

        mpu6050_get_gyro_readings_dps(gyro_angular);
        gy271_magnetometer_readings_micro_teslas(magnetometer_data);
        fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050


        // Calculate using sensor data
        get_ned_coordinates(acceleration_data, magnetometer_data, north_direction, east_direction, down_direction);
        calculate_pitch_and_roll(acceleration_data, &roll, &pitch);
        calculate_yaw(magnetometer_data, &yaw);



        // // Joystick values, 50 is basically zero position
        uint8_t x = 50;
        uint8_t y = 50;

        // uint32_t start_point = HAL_GetTick();
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
            extract_request_values((char*) rx_data, strlen((char*) rx_data), &x, &y);
            printf("Dat %d %d\n", x, y);
        }

        uint32_t end_point = HAL_GetTick();
        printf("Radio time: %d ms\n", end_point - start_point);
        // uint32_t end_point = HAL_GetTick();
        // printf("Radio time: %d ms\n", end_point - end_point);

        // Find the initial position in degrees and apply it to the gyro measurement integral
        // This will tell the robot which way to go to get the actual upward

        // Convert angular velocity to actual degrees that it moved and add it to the integral (dead reckoning not PID)
        gyro_degrees[0] += (gyro_angular[0] * (1.0 / refresh_rate_hz));
        gyro_degrees[1] += (gyro_angular[1] * (1.0 / refresh_rate_hz));
        gyro_degrees[2] += (gyro_angular[2] * (1.0 / refresh_rate_hz));

        // Apply complimentary filter
        gyro_degrees[0] = (gyro_degrees[0] * (1.0 - complementary_ratio)) + (complementary_ratio * (-roll));
        gyro_degrees[1] = (gyro_degrees[1] * (1.0 - complementary_ratio)) + (complementary_ratio * (-pitch));
        gyro_degrees[2] = (gyro_degrees[2] * (1.0 - complementary_ratio)) + (complementary_ratio * (-yaw));


        // printf("ROll: (%6.2f * %6.2f) + (%6.2f)\n",gyro_degrees[0], 1.0-complementary_ratio, complementary_ratio * (-roll) );
        // printf("Degrees: roll: %6.2f pitch: %6.2f yaw: %6.2f\n", roll, pitch, yaw);

        // React to data
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("TEMP %6.5f, ", temperature);
        // printf("PRES %6.5f, ", pressure);
        // printf("GPS %6.2f %c  %6.2f %c\n", longitude, longitude_direction, latitude, latitude_direction);
        // printf("\n");

        // For calibrating magnetometer
        // printf(
        //     "%f,%f,%f\n",
        //     magnetometer_data[0],
        //     magnetometer_data[1],
        //     magnetometer_data[2]
        // );

        // brightness++
        // Duty range is from 0 to 2000
        brightness = ++brightness % 100;
        // printf("Speed: %d\n", brightness);

        uint16_t value = setServoActivationPercent(x, 25, 125);
        TIM1->CCR1 = value;
        TIM1->CCR4 = value;
        TIM2->CCR1 = value;
        TIM2->CCR2 = value;



        loop_end_time = HAL_GetTick();
        deltaLoopTime = loop_end_time - loop_start_time;
        printf("Tim: %d ms\n", deltaLoopTime);
        if (deltaLoopTime < (1000 / refresh_rate_hz))
        {
            HAL_Delay((1000 / refresh_rate_hz) - deltaLoopTime);
        }
        loop_start_time = HAL_GetTick();
        HAL_Delay(1000 / (refresh_rate_hz * 2));
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
        HAL_Delay(1000 / (refresh_rate_hz * 2));
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
    }
}

// 0.5ms to 2ms = range is 1.5
// 0.5 is 2.5%  and is 25
// 2   is 10%   amd is 100
// 100 - 25 = 75

// default min and max is 25 and 75
uint16_t setServoActivationPercent(uint8_t percent, uint16_t minValue, uint16_t maxValue)
{
    float percentProportion = percent / 100.0;
    return percentProportion * (maxValue - minValue) + minValue;
}

void extract_request_values(char *request, uint8_t request_size, uint8_t *x, uint8_t *y)
{
    uint8_t x_index = 1;
    uint8_t x_end_index = 0;

    for (uint8_t i = 1; i < request_size; i++)
    {
        if (request[i] == '/')
        {
            x_end_index = i;
            break;
        }
    }

    uint8_t y_index = x_end_index + 1;
    uint8_t y_end_index = request_size - 1;

    uint8_t x_length = x_end_index - x_index;
    char x_substring[x_length + 1];
    strncpy(x_substring, &request[x_index], x_length);
    x_substring[x_length] = '\0';
    *x = atoi(x_substring);

    uint8_t y_length = y_end_index - y_index + 1;
    char y_substring[y_length + 1];
    strncpy(y_substring, &request[y_index], y_length);
    y_substring[y_length] = '\0';
    *y = atoi(y_substring);
}

void fix_mag_axis(float *magnetometer_data)
{
    float temp = 0.0;
    temp = magnetometer_data[0];
    // y is x
    magnetometer_data[0] = magnetometer_data[1];
    // x is -y
    magnetometer_data[1] = -temp;
}

/* Auto generated shit again-----------------------------------------------*/

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Configure the main internal regulator output voltage
     */
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 13;
    RCC_OscInitStruct.PLL.PLLN = 100;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 4;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV4;

